const jokes = [
    "متى يجي اليوم اللي أدخل فيه البيت... وأسمعها تقول: \"أص! أص! يا أولاد، أبوكم جاء...\" 😢",
    "مليت، كلما أدخل البيت أسمع: \"جاء الصايع الضايع...\" 🤡🤕",
    "حكمة اليوم: إذا طعنك صاحبك في الظهر، اطعنه بالمغرب لأن ليل، ظلام... فهمت؟ 😂😹",
    "تكره نفسك لما تمزح مع واحد عندك له فلوس تجلس خائف على مشاعره أكثر من حبيبتك 🌞🌝💔",
    "لا تاخد الامور بشكل جدي 😐\nخذها بشكل جدك انت 😒\nجدي ما دخلو بالموضوع احترم نفسك 💔",
    "كم أرغب بالجلوس في مكان خالي، ولكن خالي الله يهديه مش راضي يقوم 🤣😢",
    "واحد يقول من الزهق شخبطت على ورقة ونزلت اعطيتها للصيدلاني\nقال الصيدلاني:\nهذا منقطع من فتره، لكن عندنا بديل له 🤣😂"
];

module.exports = async function(sock, chatId, message) {
    const randomJoke = jokes[Math.floor(Math.random() * jokes.length)];
    
    await sock.sendMessage(chatId, {
        text: `*↢ نكتـة اليوم:*\n\n${randomJoke}`
    }, { quoted: message });
};
