async function menu3Command(sock, chatId, message) {
    const menuMessage = `✦• *أهلاً بك عزيزي في* •✦
‿︵‿︵‿︵‿︵‿︵‿︵
قائمة الوضع والاضافات
═⨳═⨳═⨳═⨳═⨳═⨳═⨳═⨳

*- اوامــر الوضــع والاضافــات .*
*ٴ┈┈─┈─┈─┈─┈─┈─┈─┈─┈*
*- التحـكم بـالاوامـر*
*ٴ┈┈─┈─┈─┈─┈─┈─┈─┈─┈*
*- تغيير امر*
*- حذف امر*
*- الاوامر المضافه*
*- مسح الاوامر المضافه*
*ٴ┈┈─┈─┈─┈─┈─┈─┈─┈─┈*
*- التحـكم بالاشتـراك الاجبـاري*
*ٴ┈┈─┈─┈─┈─┈─┈─┈─┈─┈*
*- اضف اشتراك*
*- حذف اشتراك*
*- عرض الاشتراك*
*ٴ┈┈─┈─┈─┈─┈─┈─┈─┈─┈*
*- التحـكم بـالمنـع*
*ٴ┈┈─┈─┈─┈─┈─┈─┈─┈─┈*
*- منع ↢ بالرد على كلمة*
*- الغاء منع* 
*- قائمه المنع*
*- مسح قائمه المنع*
*ٴ┈┈─┈─┈─┈─┈─┈─┈─┈─┈*
*- اوامــر وضــع المجـمـوعــة*
*ٴ┈┈─┈─┈─┈─┈─┈─┈─┈─┈*
*- اسم القروب + الاسـم*
*- صوره القروب ↢بالرد - بالتعليق*
*- وصف القروب*
*- مسح الوصف*
*╎ ↫ ضع ترحيب ↫ لتخصيص الترحيب*
*╎ ↫ الترحيب ↫ لعرض الترحيب*
*╎ ↫ مسح الترحيب ↫ للحذف*
*╎ ↫ تعطيل الترحيب ↫ للإيقاف*
*╎ ↫ ━━━━━━━━ ↫*
*╎ ↫ اضف رد ↫ لإضافة رد مخصص*
*╎ ↫ مسح رد ↫ لحذف رد*
*╎ ↫ الردود ↫ لعرض كل الردود*
*╎ ↫ ━━━━━━━━ ↫*
*- قوانين*
*- مسح القوانين*
*- تثبيت*
*- الغاء تثبيت*
*- الغاء المثبت*
*- ضع لقب + اللقب ↢ بالـرد*
═⨳═⨳═⨳═⨳═⨳═⨳═⨳═⨳`;

    try {
        await sock.sendMessage(chatId, { 
            text: menuMessage,
            contextInfo: {
                forwardingScore: 1,
                isForwarded: true,
                forwardedNewsletterMessageInfo: {
                    newsletterJid: '120363161513685998@newsletter',
                    newsletterName: 'KnightBot MD',
                    serverMessageId: -1
                }
            }
        },{ quoted: message });
    } catch (error) {
        console.error('Error in menu3 command:', error);
        await sock.sendMessage(chatId, { text: menuMessage },{ quoted: message });
    }
}

module.exports = menu3Command;