module.exports = async function(sock, chatId, message) {
    const txt = `*↢ قائمة اوامر التسـليـة والالعـاب*
─────────────────────
↢ التســـــلية
─────────────────────
↢ حب ↢بالـرد
↢ كره ↢بالـرد
↢ حظي - حظه ↢بالـرد
↢ عمري - عمره ↢بالـرد
↢ وجهي - وجهه ↢بالـرد
↢ برجي ↢بالـرد
↢ امنيتي - امنيته ↢بالـرد
↢ نجومي - نجومه ↢بالـرد
↢ مزاجي - مزاجه ↢بالـرد
↢ من يحبني - من يحبه ↢بالـرد
↢ من يكرهني - من يكرهه ↢بالـرد
↢ غباء - غبائه ↢بالـرد
↢ نكته
↢ ذكاء
↢ شِعر
↢ ايش تختار
↢ اقتباس`;

    await sock.sendMessage(chatId, { text: txt }, { quoted: message });
};